Workspace/run/sod_shock_tube/0_org/T.test2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    leftSide
    {
        type            zeroGradient;
    }
    rightSide
    {
        type            temperatureOutletNSCBC;
        field           T;
        phi             phi;
        rho             rho;
        p               p;
        psi             thermo:psi;
	gamma           1.4;
        fieldInf        1;
        lInf            1;
        pInf            100000;
        etaAc           1;
        value           uniform 293;
    }
    emptywalls
    {
        type            empty;
    }
}


// ************************************************************************* //
