Workspace/run/sod_shock_tube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    leftSide
    {
        type            patch;
        nFaces          1;
        startFace       4999;
    }
    rightSide
    {
        type            patch;
        nFaces          1;
        startFace       5000;
    }
    emptywalls
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       5001;
    }
)

// ************************************************************************* //
